Autodesk.Revit.DB.ExportLinetypeTable.Remove(Autodesk.Revit.DB.ExportLinetypeKey)
Removes the pair (key, info) corresponding to the given ExportLinetypeKey.
exportLinetypeKey:
The export line type key
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLinetypeTable.Add(Autodesk.Revit.DB.ExportLinetypeKey,Autodesk.Revit.DB.ExportLinetypeInfo)
Inserts a (key, info) pair into Export line type table.
exportLinetypeKey:
The export line type Key to be added.
exportLinetypeInfo:
The export line type info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLinetypeTable.GetExportLinetypeInfo(Autodesk.Revit.DB.ExportLinetypeKey)
Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey.
exportLinetypeKey:
The export line type Key.
Returns:
Returns the line type info for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLinetypeTable.ContainsKey(Autodesk.Revit.DB.ExportLinetypeKey)
Checks whether a pattern key exists in the table.
exportLinetypeKey:
The export line type key.
Returns:
True if the line type exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLinetypeTable
A table supporting a mapping of linetypes in Revit to linetype names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportLinetypeKey to
Autodesk.Revit.DB.ExportLinetypeInfo members.  The Autodesk.Revit.DB.ExportLinetypeKey
contains the identification information for the pattern table: the Revit linetype name.  The
Autodesk.Revit.DB.ExportLinetypeInfo contains the linetype name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportLinetypeInfo returned will be a copy of the Autodesk.Revit.DB.ExportLinetypeInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportLinetypeInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportLinetypeInfo back into the table using the same key.

Autodesk.Revit.DB.ExportLinetypeTable.Item(Autodesk.Revit.DB.ExportLinetypeKey)
A copy of the Autodesk.Revit.DB.ExportLinetypeInfo for the linetype's Autodesk.Revit.DB.ExportLinetypeKey.
Remarks:
When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportLinetypeInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportLinetypeInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportLinetypeInfo back into the table using the same key.
exportLinetypeKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportLinetypeInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When getting this property:
An entry with the given key is not present in the table.
Since:
2014